** neck <2016-06-21 Tue>
 英  [nek]   美  [nɛk]
n. 脖子；衣领；海峡
vi. 搂著脖子亲吻；变狭窄
vt. 使变细；与…搂著脖子亲吻
n. (Neck)人名；(德、意、英)内克
 柯林斯英汉双解大词典  21 世纪大英汉词典

neck /nɛk/  CET4 TEM4
N-COUNT Your neck is the part of your body which joins your head to the rest of your body. 颈
例：
She threw her arms around his neck and hugged him warmly.
她伸出双臂搂住他的脖子，热烈地拥抱他。
N-COUNT The neck of an article of clothing such as a shirt, dress, :LOGBOOK:
CLOCK: [2016-07-12 Tue 03:01]--[2016-07-12 Tue 04:48] =>  1:47
:END:or sweater is the part which surrounds your neck. 领口
例：
...the low, ruffled neck of her blouse.
…她褶边低胸的衬衫领口。
N-COUNT The neck of something such as a bottle or a guitar is the long narrow part at one end of it. (瓶子、吉他等的) 颈状部位
例：
Catherine gripped the broken neck of the bottle.
凯瑟琳紧握着破裂的瓶颈。
PHRASE If you say that someone is breathing down your neck, you mean that they are watching you very closely and checking everything you do. 密切监视
例：
Most farmers have loan officers breathing down their necks.
大多数农场主受到信贷员的密切监视。
PHRASE In a competition, especially an election, if two or more competitors are neck and neck, they are level with each other and have an equal chance of winning. 势均力敌
例：
The latest polls indicate that the two main parties are neck and neck.
最新的民意测验显示两个主要政党势均力敌。
PHRASE If you stick your neck out, you bravely say or do something that might be criticized or might turn out to be wrong. 敢说敢干
例：
During my political life I've earned myself a reputation as someone who'll stick his neck out, a bit of a rebel.
我在自己的政治生涯中得了一个敢说敢干、有点叛逆的名声。
网络释义 专业释义 英英释义

 脖子
 颈
 颈部
 颈
短语
Stiff neck 落枕
Stiff neck 脖子发僵
Stiff neck 落枕
Stiff neck 顽固之人
goose neck 鹅颈管
  更多结果
词组短语 同近义词 同根词

neck and neck 并驾齐驱，不分上下
bottle neck 瓶颈
pain in the neck 极讨厌的人或事
stiff neck 脖子发僵，斜颈；顽固之人
neck of the woods 附近一带（一般指乡村地区）
  更多词组短语
双语例句 原声例句 权威例句

He draped his arms round her neck.
他双手搂住了她的脖子。 
The rain was dripping down his neck.
雨水沿着他的脖子往下滴。 
The doll pivots at the waist and neck.
那洋娃娃的腰和颈可以转动。 
 更多双语例句
百科

Neck

The neck is the part of the body, on many terrestrial or secondarily aquatic vertebrates, that distinguishes the head from the torso or trunk. The adjective (from Latin) signifying "of the neck" is cervical (though in non-technical contexts, this is more frequently used to describe the cervix).
来源于：维基百科

literate 
 英  ['lɪt(ə)rət]   美  ['lɪtərət]
adj. 受过教育的；精通文学的
n. 学者
 柯林斯英汉双解大词典  21 世纪大英汉词典

literate /ˈlɪtərɪt/  CET6+ TEM8
ADJ Someone who is literate is able to read and write. 能读会写的
例：
Over one-quarter of the adult population are not fully literate.
四分之一以上的成年人是半文盲。
→ see also computer-literate
网络释义 专业释义 英英释义

 有文化的
 有读写能力的
 识字的
 学者
短语
Literate programming 文学编程
Literate programming 文学编程
Literate programming 文学化编程
Literate programming 字面编程
Financially Literate 掌握一定财务知识
  更多结果
词组短语 同近义词 同根词

computer literate 懂电脑
双语例句 原声例句 权威例句

The drawback of the internet is that you have to be literate to use it.
互联网的缺点就是人们必须得有文化才能使用它。 
article.yeeyan.org
 更多双语例句
百科

Literate

Literacy is traditionally understood as the ability to read and write. The term's meaning has been expanded to include the ability to use language, numbers, images and other means to understand and use the dominant symbol systems of a culture. The concept of literacy is expanding in OECD countries to include skills to access knowledge through technology and ability to assess complex contexts.Literacy represents the lifelong, intellectual process of gaining meaning from a critical interpretation of written or printed text. The key to all literacy is reading development, a progression of skills that begins with the ability to understand spoken words and decode written words, and culminates in the deep understanding of text. Reading development involves a range of complex language underpinnings including awareness of speech sounds (phonology), spelling patterns (orthography), word meaning (semantics), grammar (syntax) and patterns of word formation (morphology), all of which provide a necessary platform for reading fluency and comprehension. Once these skills are acquired, the reader can attain full language literacy, which includes the abilities to apply to printed material critical analysis, inference and synthesis; to write with accuracy and coherence; and to use information and insights from text as the basis for informed decisions and creative thought. The inability to do so is called illiteracy or analphabetism.The United Nations Educational, Scientific and Cultural Organization (UNESCO) defines literacy as the "ability to identify, understand, interpret, create, communicate and compute, using printed and written materials associated with varying contexts. Literacy involves a continuum of learning in enabling individuals to achieve their goals, to develop their knowledge and potential, and to participate fully in their community and wider society".
来源于：维基百科

** lesson nineteen<2016-07-07 Thu> 
:LOGBOOK:
CLOCK: [2016-07-07 Thu 04:17]--[2016-07-07 Thu 04:42] =>  0:25
:END:
a cheek
an ear 
an eye 
a face
a nose
a mouth

a stomach
shoulders
a neck 
a body
a head
a back

an arm 
a foot 
a leg
a hand
a finger
kness
 
a child's face
a woman's face
The woman has a long neck.
The giraffe has a very long neck.
A man's face
The man is on his knees.
knees 
 英  [niːz]   美  [niːz]
[解剖] 膝

big stomach
The boy has dirty cheeks.
The boy has a big nose.
Mother kisses her son's pink cheek.
The girl is wearing a scarf on her neck and a cap  on her head.
The man has a wide back.

a woman's ear 
a finger on the computer
an open mouth
closed eyes
a closed mouth
open eyes

The woman is putting a glove on her hand.
a woman with her eyes closed.
The girl has shoes on her feet.
The girl does not have any shoes on her feet.
The son is sitting on his father's shoulders.
The child is sitting on his mother's knee.

The child's foot is in his mother's hands.
The man is holding a finger in his mouth.
The child is in his mother's arms.
The child's hand is holding his mother's finger.
a grown-up's leg
a grown-up's foot

Is the white-haired girl speaking in the black-haired girl's ear? Yes, she is speaking on the balck-haired ear.
Is this face sad? Yes, it is sad.
Is the boy speaking in his friend's ear? Yes, he is speaking in his friend's
ear.
Is this face cheerful? Yes, it is cheerful.
Does the bear have a short neck? Yes, it does have a short neck.
Is the woman putting a hat on her head? Yes, she is putting a hat on her head.

Is the child's head big or small? His head is small.
Is this a woman's face or a man's face? This is a man's face.
Is  mother kissing her son's cheek or nose? She is kissing her son's cheek.
Is the child sitting on his mother's or grandma's knee? He is sitting on his
grandma's knee.
Is the child's face clean or dirty? His face is clean.
Are the child's feet big or small? His feet are small.
96.9% 
** DONE lesson twenty seven
CLOSED: [2016-07-12 Tue 04:48]
:LOGBOOK:
CLOCK: [2016-07-12 Tue 03:01]--[2016-07-12 Tue 04:48] =>  1:47
:END:
holiday
morning
breakfast
evening
lunch
dinner

to eat lunch
to give as a present
to eat dinner
to congratulate vt. 祝贺；恭喜；庆贺
to eat dinner
to celebrate
sunny morning
birthday
present
evening by the sea
evening walk
winter evening

The man drinks coffee and reads the newspaper in the morning befor work.
Cat also doesn't like to get up early in the morning very much.
Adults do not like to get up early in the morning very much.
Children and adults like presents very much.
This is a business lunch.
There are few cars on the streets at night.

People eat dinner in the evening after work.
The businesswoman is eating lunch on the bench in the park.
The young husband and wife are eating lunch on the grass.
People sleep at night.
People eat breakfast in the morning.
People eat lunch during the day.

Dinner in a beautiful restaurant is a good way to relax after a working day.
They bring presents for the bridegroom and bride.
It is a big job to cook for a holiday.
They bring presents on a birthday.
There are many beautiful dishes on the holiday table.
The birthday is a joyous holiday.

The young man is giving the girl flowers.
The young people are having a good time at the party.
The young man is giving the girl a toy.
A car is an expensive present.
The adults are celebrating a wedding.
The children are celebrating a birthday.

The family is having dinner in the evening.
The parents and their children are having breakfast in the morning.
This girl is sad, because she is not celebrating her birthday.
There is a lot of delicious food at the holiday table.
The girl is celebrating her birthday.
The parents and the children are having lunch during the day.

Do people tan in the morning or in the evening? People tan in the morning.
Do people eat breakfast or eat dinner in the morning? People eat breakfast in
the morning.
Do they usually drink orange juice for breakfast or for dinner? They usually
drink orange juice for breakfast.
Do children like to celebrate their birthday? Yes, they like to celebrate the
holidays very much.
Is a birthday a sad or a joyous holiday? A birthday is a joyous holiday.
Do people sleep or eat lunch at night? People sleep at night.

Do they eat meat for lunch? Yes, a lot of people eat meat for lunch.
Do they eat eggs for breakfast or lunch? They usually eat eggs for breakfast.
Do they drink wine for breakfast ? ,No,they drink wine for dinner and for lunch.
Do the guests like the party? Yes, the guests like the party very much.
Do they eat bread and butter for breakfast? Yes, they do.
Do they eat cheese for breakfast? Yes, they do.
97.4%
